package gezginsaticiproblemi;

import java.util.*;

public class SehirlerArasiMesafe {
 private int sehirnumaralari;//------------------------------------------------->1
  Stack <Integer> stack;     //------------------------------------------------->1
 
 public SehirlerArasiMesafe(){
  stack=new Stack<Integer>();//------------------------------------------------->1
 }
 public void Gezme(int mesafe[][]){
//Burada kendi şehrimiz haric sehirleri belirledim
  sehirnumaralari=mesafe[0].length-1;//----------------------------------------->1
//Burada sehir gezilen listesi olusturdum
  int [] gezilensehir=new int[sehirnumaralari+1];//----------------------------->1
  gezilensehir[1]=1;       //--------------------------------------------------->1
  stack.push(1);//Butun stacklere 1 degerini atadım.//-------------------------->1
  int deger,dst=0;//------------------------------------------------------------>1
  int i;//---------------------------------------------------------------------->1
  int mindeger=Integer.MAX_VALUE;//--------------------------------------------->1
  boolean mingitme=false;//----------------------------------------------------->1
  System.out.println(1+"\t");//------------------------------------------------->1
  int sayac =0;
  int sayac1 =0;
  int sayac2 =0;
  while(!stack.isEmpty())//----------------------------------------------------->17
  {
      //System.out.println(sayac+++" öfşl");
   deger=stack.peek();//-------------------------------------------------------->17
   i=1;               //-------------------------------------------------------->17
   mindeger=Integer.MAX_VALUE;//------------------------------------------------>17
   while(i<=sehirnumaralari){//------------------------------------------------->17 x 152 = 2584
       // Buradaki iç içe while döngüsünden ve Gezginsatıcı clasında olan içi içe for döngülerinden karmaşıklığı O(n^2) olacak
    if(mesafe[deger][i]>1 &&gezilensehir[i]==0){//------------------------------>17 x 152 = 2584
     if(mindeger>mesafe[deger][i]){//------------------------------------------->17 x 35 = 595
      mindeger=mesafe[deger][i];//---------------------------------------------->17 x 19 = 323 
      dst=i;//------------------------------------------------------------------>17 x 19 = 323
      mingitme=true; //--------------------------------------------------------->17 x 19 = 323

     }
    }
    i++;//---------------------------------------------------------------------->17 x 152 = 2584
   }
   if(mingitme){//-------------------------------------------------------------->17
    gezilensehir[dst]=1;//------------------------------------------------------>17
    stack.push(dst);//---------------------------------------------------------->17
    System.out.println(dst+"\t");//--------------------------------------------->17
    mingitme=false;//----------------------------------------------------------->17
    continue;//----------------------------------------------------------------->17
   }
   stack.pop();//--------------------------------------------------------------->17
  }
 }//------------------------------------------------------------>SehirlerArasiMesafe çalışma zamanı = 9515
}
